In [18]:
ep = "https://raw.githubusercontent.com/cho6019/nextjs-fastapi-starter/refs/heads/0.6/korea/endpoints.json"

In [19]:
import pandas as pd
import requests

In [20]:
res = requests.get(ep)

In [21]:
res.status_code

200

In [22]:
res.encoding

'utf-8'

In [23]:
res.text

'{\n    "endpoints": [\n        {\n            "name": "TOM",\n            "url": "https://ac.sunsin.shop/api/py/select_all"\n        },\n        {\n            "name": "jiwon",\n            "url": "https://agecal.wodan10.shop/api/py/select_all"\n        },\n        {\n            "name": "heejin",\n            "url": "https://age.journeyjean.shop/api/py/select_all"\n        },\n        {\n            "name": "hyun",\n            "url": "https://agecalculator.calcalhan.store/api/py/select_all"\n        },\n        {\n            "name": "cho",\n            "url": "https://nextjs-fastapi-starter-5j3bemub7-chominkyus-projects.vercel.app/api/py/select_all"\n        },\n        {\n            "name": "jacob",\n            "url": "https://jacob0503.vercel.app/api/py/select_table"\n        },\n        {\n            "name": "nuni",\n            "url": "https://ac.nunininu.shop/api/py/select_all"\n        },\n        {\n            "name": "lucas",\n            "url": "https://ac.lucas12.store/api/py/select_all"\n        },\n        {\n            "name": "SEO",\n            "url": "https://ac.seo-sigma.shop/api/py/select_all"\n        },\n        {\n            "name": "JERRY",\n            "url": "https://jooon.vercel.app/api/py/select_all"\n        }\n    ]\n}\n'

In [24]:
res.json()

{'endpoints': [{'name': 'TOM',
   'url': 'https://ac.sunsin.shop/api/py/select_all'},
  {'name': 'jiwon', 'url': 'https://agecal.wodan10.shop/api/py/select_all'},
  {'name': 'heejin', 'url': 'https://age.journeyjean.shop/api/py/select_all'},
  {'name': 'hyun',
   'url': 'https://agecalculator.calcalhan.store/api/py/select_all'},
  {'name': 'cho',
   'url': 'https://nextjs-fastapi-starter-5j3bemub7-chominkyus-projects.vercel.app/api/py/select_all'},
  {'name': 'jacob', 'url': 'https://jacob0503.vercel.app/api/py/select_table'},
  {'name': 'nuni', 'url': 'https://ac.nunininu.shop/api/py/select_all'},
  {'name': 'lucas', 'url': 'https://ac.lucas12.store/api/py/select_all'},
  {'name': 'SEO', 'url': 'https://ac.seo-sigma.shop/api/py/select_all'},
  {'name': 'JERRY', 'url': 'https://jooon.vercel.app/api/py/select_all'}]}

In [25]:
res = requests.get('https://ac.sunsin.shop/api/py/select_all')
data = res.json()
df_tome = pd.DataFrame(data)
df_tome.head(1)

  menu_name name          dt
0       설렁탕  TOM  2025-02-07

In [26]:
new_rows = []

import pandas as pd

df1 = pd.DataFrame({"id": [1, 2, 3], "name": ["KIM", "MIN", "LEE"]})
df2 = pd.DataFrame({"id": [2, 3, 4], "name": ["MIN", "LEE", "PARK"]})

for _, row_j in df2.iterrows():
    for _, row_t in df1.iterrows():
        is_match_columns = True
        for col in df1.columns:
            if row_j[col] != row_t[col]:
                is_match_columns = False
        if is_match_columns:
            break
    if not is_match_columns:
        new_rows.append(row_j)

df3 = pd.DataFrame(new_rows)
df3

   id  name
2   4  PARK

In [27]:
from pandasql import sqldf

In [32]:
query="""
SELECT df2.id, df2.name
FROM df2 left join df1
ON df1.id = df2.id AND df1.name = df2.name
WHERE df1.id IS NULL
"""
pysqldf = lambda q: sqldf(q, globals())
result = pysqldf(query)
result

   id  name
0   4  PARK

In [29]:
merge_df = pd.merge(df1, df2, how='right', indicator=True)
merge_df = merge_df[merge_df['_merge']=='right_only'].drop('_merge', axis=1)
merge_df

   id  name
2   4  PARK

In [30]:
merge_df

   id  name
2   4  PARK

In [ ]:
result, merge_df, df3

In [33]:
print(result)
print(merge_df)
print(df3)

   id  name
0   4  PARK
   id  name
2   4  PARK
   id  name
2   4  PARK

In [35]:
print(merge_df == df3)

     id  name
2  True  True